# Содержание курса

# Все содержимое данного курса можно разделить на две части:

# Теоретические материалы
# Практические задания
# Теоретические материалы

# В данных материалах собрана вся необходимая информация для изучения языка Python и
# для выполнения практических заданий. Сами материалы состоят из 2-х частей
#
# для любителей посмотреть есть видеоматериалы
# для любителей почитать есть текстовое сопровождение лекции
# Также внутри текстового представления лекции вы будете встречать вот такие элементы кода

# Здесь слева отображается программа, а справа представлен результат ее выполнения

# С этим кодом можно и нужно взаимодействовать,
# потому что программирование это не только написание своего кода,
# но и исправление уже существующего.
# Взаимодействие с чужим кодом - один из главных навыков программиста

# Вы можете код, расположенный в этом блоке, запускать сколько угодно раз,
# нажав значок Треугольник, вносить в него изменения и запускать уже исправленную вами версию кода.
# Настоятельно рекомендую пользоваться этим инструментом.
# Лучше всего с ним взаимодействовать с компьютера,
# потому что мобильная версия данного элемента отличается от десктопной. Вот так она выглядит

# Здесь приводится уже результат выполнения кода.
# Чтобы взглянуть на сам код, необходимо нажать на значок Карандаш.
