# Перед вами список numbers, состоящий из 100 целых чисел

# Ваша задача пройтись в цикле по элементам списка и увеличить каждый в 2 раза.

# В итоге изначальный список numbers  должен измениться

# В качестве ответа распечатайте измененный список numbers

numbers = [-35, 68, -91, 23, -92, -82, -74, 32, 39, -30, -100, -29, 54, 26, 54, -45, 20, 53, -17, 68, -35, 11, 26, -17,
           70, 89, -81, -4, 61, -45, 13, 63, -48, -66, -92, -15, -88, -87, -75, 44, -49, -81, 19, -33, -59, 85, -69,
           -60, 9, -98, 28, 11, 15, -35, -80, 5, -20, -52, -45, 26, 47, -16, 40, -14, -12, 15, 73, -16, 29, -98, 93,
           -77, 1, 85, 77, 73, 100, -71, 99, 39, 2, -38, 49, -31, 15, 43, 94, -39, -89, -46, -71, 39, -56, 41, -93, 4,
           -79, 48, 88, -51]
for i in range(len(numbers)):
    numbers[i] *= 2
print(numbers)
