"""Добро пожаловать на курс!"""
# Добро пожаловать на первое занятие, посвященное языку программирования

# Python (с англ. пайтон, питон).
# Python в течение многих лет стабильно набирает популярность и на момент мая 2022 года
# во многих рейтингах он находится в самом топе. А в рейтинге PYPL Python находится на первом месте:

# Давайте разберемся, почему Python стал таким популярным:

# У Python очень простой синтаксис.
# На нем легко как писать, так и читать программы.
# Если вы новичок в программировании и ищете свой первый язык, то Python -
# это прекрасный вариант выбора для вас.

# Python является кроссплатформенным. То есть программа, написанная на Windows,
# легко запустится на Linux или MacOs.

# Python очень мощный, т.е. функциональный.
# У него очень много библиотек, с помощью которых можно написать программы
# для решения совершенно разных задач.
# Вы можете создать web-приложение, desktop-приложение, написать игры, скрипты,
# скраппинги, различных ботов под сайты и т.д.
#
# Python подходит для изучения школьникам, так как в последние годы его включили в перечень языков,
# на котором можно писать вступительные экзамены, т.е. ОГЭ и ЕГЭ по информатике.
# Его также можно использовать для олимпиадного программирования,
# так как большинство тестирующих систем в своем наличии имеют интерпретатор Python,
# поэтому можно спокойно сдавать свои решения на этом ЯП (языке программирования).

# Что касается минусов:

# Программы, написанные на Python, уступают по скорости аналогичным программам,
# которые написаны на компилируемых языках, например, C++ и Java.
# Также у Python есть небольшой недостаток в несовместимости версий.
# Например, программы, написанные на 2-ой версии, не могут запускаться на Python 3.
# В нашем курсе мы будем изучать только актуальную версию - Python 3.
# И я, как разработчик, на реальных проектах ни разу не видел использование Python 2,
# только на stackoverflow или в литературе.
#
# Это вкратце все плюсы и минусы языка Python, которыми я хотел с вами поделиться.
# Желаю удачи в изучении :)
