# Поддержка и общение

# Задачи на программирование будут иметь разный уровень сложности.
# В процессе выполнения некоторых из них может появиться желание все бросить.
# Другие задачи с виду могут казаться вам легкими,
# но все равно может возникнуть чувство непонимания,
# как это запрограммировать... Это неприятно, но это нормально.
# Каждый, кто обучался программированию, через это проходил.

# После решения простых задач чувствуется уверенность и восторг,
# но задачи посложнее могут вогнать в уныние.

# Какие выходы есть из этой ситуации? Я могу посоветовать два варианта:

# Если долго мучаетесь с одной задачей, то можете ее пропустить и вернутся позднее к ее выполнению.
# Пройдите пока новые темы, наберитесь опыта решения других задач.
# Со временем идея решения пропущенной задачи к вам обязательно придет
# Вы всегда можете попросить помощи у ваших сокурсников.
# Вопросы можно задать в комментариях под уроками,
# но лучше всего обращаться в телеграмм-чат. Ответ будет более оперативным.

# И помните, хорошо сформулированный вопрос уже представляет собой часть ответа

# На этом наша вводная часть завершилась и давайте приступать к установке самого python
