# Минутка сожаления

# «Надо было брать биткоин в 2012!» именно такую фразу ваша программа должна вывести на экран 13 раз

# Формат входных данных

# Формат выходных данных
# Программа должна вывести 13 раз фразу «Надо было брать биткоин в 2012!»,
# каждый раз на отдельной строке и без кавычек.

print('Надо было брать биткоин в 2012!\n' * 13, end='')
