# Напишите программу, которая найдет сумму кубов натуральных чисел от 50 до 100 включительно

# print(sum([pow(i, 3) for i in range(50, 101)]))

'''
sum_of_cubes = (100 * (100 + 1) / 2) ** 2 - (49 * (49 + 1) / 2) ** 2
sum_of_cubes = (100 * 101 / 2) ** 2 - (49 * 50 / 2) ** 2
sum_of_cubes = 5050 ** 2 - 1225 ** 2
sum_of_cubes = 25502500 - 1500625
sum_of_cubes = 24001875
'''
