# Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно),
# после чего вывести данную строку, увеличенную по длине в 3 раза.

# Sample Input 1:

# Hello
# Sample Output 1:

# HelloHelloHello
# Sample Input 2:

# Python is the best
# Sample Output 2:

# Python is the bestPython is the bestPython is the best

print(input() * 3)
