# Напишите программу, которая выводит фразу «Я стану крутым программистом!»
# три раза на отдельных строках; строки должны быть именно такие, символ в символ!

# Для удобства советую поместить эту фразу в переменную и затем использовать ее при выводе.

# Sample Input:

# Sample Output:

# Я стану крутым программистом!
# Я стану крутым программистом!
# Я стану крутым программистом!

# [print("Я стану крутым программистом!") for _ in range(3)]
print("Я стану крутым программистом!\n"*3, end="")
