# Напишите программу, которая выводит «Лев Николаевич Толстой написал "Война и мир"» (без внешних кавычек).

print('Лев Николаевич Толстой написал "Война и мир"')
