# Напишите программу, которая считывает с клавиатуры фразу
# и выводит на экран количество символов,
# которое содержалось в ней, учитывая все знаки препинания и пунктуации.

# Sample Input:

# Один,два,три
# Sample Output:

# 12

print(len(input()))
