# Мы с вами уже познакомились с оператором присваивания.
# Обозначается он знаком = и его предназначение сохранить значение,
# находящееся справа от него, в переменную, находящуюся слева.

# x = y + z
# В примере выше сперва найдется сумма переменных y и z,
# так как это выражение находится справа от знака =.
# И затем полученное значение сохранится в переменной x
#
# Но в  python существует конструкция присвоения с дополнительным оператором.
# Давайте взглянем на самые используемые варианты:
#
# Оператор	Описание	Синтаксис
# +=	Сложение с присвоением: складывает левый операнд с правым,
# и затем присваивает полученное значение левому операнду	a += b

# -=	Вычитание с присвоением: вычитаем из левого операнда правый,
# и затем присваивает полученное значение левому операнду	a -= b


# *=	Умножение с присвоением: перемножает левый операнд с правым,
# и затем присваивает полученное значение левому операнду	a *= b

# /=	Деление с присвоением: делит левый операнд на правый,
# и затем присваивает полученное значение левому операнду	a /= b

# //=	Деление нацело с присвоением: нацело делит левый операнд на правый,
# и затем присваивает полученное значение левому операнду	a //= b

# %=	Деление по остатку присвоением: делит по остатку левый операнд на правый,
# и затем присваивает полученное значение левому операнду	a %= b

# **=	Возведение в степень с присвоением: возводит левый операнд в степень правого операнда,
# и затем присваивает полученное значение левому операнду	a **= b

