# Перед вами кортеж my_tuple
#
# При помощи среза сохраните
#
# в переменную slice_5_10 значения с 5-го индекса по 10-й включительно
# в переменную slice_from_20 значения с 20-го индекса и по конец кортежа
# в переменную slice_to_35 значения с начала кортежа по 35-й индекс не включительно
# Распечатайте данные переменные на отдельных строках в порядке их перечисления

my_tuple = (
    32, 45, 32, 60, 43, 19, 39, 75, 50, 12, 53, 13, 28, 70, 68, 5, 64, 55, 30, 47, 23, 20, 17, 36, 45, 31, 46, 50, 33,
    45,
    9, 41, 12, 57, 40, 43, 47, 51, 56, 54, 40, 30, 37, 23, 43, 66, 64, 27, 44, 75, 51, 2, 19, 72, 30, 8, 29, 43, 7, 73,
    34,
    65, 54, 50, 43, 6, 50, 45, 49, 30, 39, 50, 41, 70, 38, 16, 31, 51, 72, 45, 58, 39, 50, 56, 24, 30, 9, 53, 27, 31,
    68,
    56, 26, 39, 34, 50, 10, 12, 3, 27)

slice_5_10 = my_tuple[5:11]
slice_from_20 = my_tuple[20:]
slice_to_35 = my_tuple[:35]

print(slice_5_10)
print(slice_from_20)
print(slice_to_35)
