# При помощи среза разверните/переверните кортеж my_tuple и распечатайте на экран полученное значение
#
# Развернуть(reverse) кортеж или любую другую упорядоченную коллекцию
# это значит расположить элементы в обратном порядке от последнего до первого

my_tuple = (
32, 45, 32, 60, 43, 19, 39, 75, 50, 12, 53, 13, 28, 70, 68, 5, 64, 55, 30, 47, 23, 20, 17, 36, 45, 31, 46, 50, 33, 45,
9, 41, 12, 57, 40, 43, 47, 51, 56, 54, 40, 30, 37, 23, 43, 66, 64, 27, 44, 75, 51, 2, 19, 72, 30, 8, 29, 43, 7, 73, 34,
65, 54, 50, 43, 6, 50, 45, 49, 30, 39, 50, 41, 70, 38, 16, 31, 51, 72, 45, 58, 39, 50, 56, 24, 30, 9, 53, 27, 31, 68,
56, 26, 39, 34, 50, 10, 12, 3, 27)
print(my_tuple[::-1])
