# Прежде чем рассмотрим сами операции стоит отметить,
# что результатом любого допустимого сравнения будет логический тип: либо значение True, либо False
#
# При любом сравнении участвуют правда операнда:
# левый операнд (стоит слева от операции сравнения) и правый операнд.
# Python поддерживает следующие операции сравнения:
#
# == Возвращает True, если оба операнда равны. ...
# != Возвращает True, если оба операнда НЕ равны. ...
# > (больше чем) Возвращает True, если первый операнд больше второго.
# < (меньше чем) ...
# >= (больше или равно) ...
# <= (меньше или равно)

# Теоретический материал по математической логике и по базовым логическим функциям
# Вы можете посмотреть по этой ссылке.
# Для успешного написания всех своих дальнейших программ
# Вы должны обязательно знать что  такое КОНЪЮНКЦИЯ(союз "and"),
# ДИЗЪЮНКЦИЯ(союз "or") И ИНВЕРСИЯ(союз "not") и также уметь строить таблицы истинности.

# Если не знаете логических функций, обязательно ознакомьтесь с этим материалом.
# https://vk.com/@egoroff_channel-logika-v-informatike
