# Все не так просто

# В этом разделе я показал вам как можно использовать оператор match-case
# для замены множественного выбора,
# но на самом деле данный оператор не так прост
# и функциональность в нем потрясающая.

# Достаточно только взглянуть на объем стандарта PEP622,
# в котором описывается операторам сопоставления с шаблонами
# (pattern matching statement), и вы поймете,
# что здесь не все так просто.

# Поэтому советую после прохождения этого курса вернуться
# к данной документации и посмотреть на остальные примеры.

# https://peps.python.org/pep-0622/
