# Создайте пустой словарь и сохраните его в переменную my_dict, затем выведите на экран эту переменную

print(my_dict:={})
