# Создайте словарь, у которого должны быть следующие пары ключ-значения
#
# Ключ	Значение
# name - строка	Vasya - строка
# surname - строка	Petrov - строка
# age - строка	25 - целое число
# Данный словарь необходимо сохранить в переменную person и затем вывести эту переменную на экран

print(person := dict(name='Vasya', surname='Petrov', age=25))
