# Ввод нескольких значений в одной строке

# Варианты использования функцииinput()

# a = input() - если необходимо ввести строку и сохранить ее в переменную а
# a = int(input()) - если необходимо ввести целое число и сохранить его в переменную а
# a = float(input()) - если необходимо ввести вещественное число и сохранить его в переменную а
# a,b = map(int,input().split()) - если необходимо ввести два целых числа в одну строку через пробел
# a,b,c = map(float,input().split()) - если необходимо ввести три вещественных числа в одну строку через пробел
