# Напишите программу, которая вычисляет среднее арифметическое четырех введенных целых чисел.

# Обратите внимание, что числа вводятся в одну строку через пробел

print(sum(map(int, a:= input().split()))/len(a))
