# Имеется три списка из 50 элементов: list_x, list_y и list_w
#
# Ваша задача произвести научные расчеты для соответствующий значений этих списков. Нужно подставить в формулу
#
# �
# 2
# −
# �
# ∗
# �
# ∗
# �
# +
# �
# 4
# x
# 2
#  −x∗y∗w+w
# 4
#
#
# поочередно первые значения из списков list_x, list_y и list_w, потом вторые, затем третьи и т.д.  Значения из списка list_x должны подставляться в переменную x, из списка list_y - в переменную y и из списка list_w - в переменную w.
#
# Всего должно получиться 50 вычисленных значений. Их необходимо сложить в список и вывести на экран.
#
# Sample Input:
#
# Sample Output:
#
# [9211, 480496, -2219, 181819, 5304420, 39916, 3418165, 1344, 66532, 63568, 2795821, 3424415, 549025, 19521, 12091, 12196, -1031, 931, 749, 6321, 812761, 719663, 12061, 72769, 883477, 930286, 456208, 2085061, 2085000, 84304, 1493825, 61759, 1494586, 10424, 397471, 3105621, 826975, 9496, 182001, 158976, 52000, 169, 734431, 833275, 193860, 28765, 563121, 194833, 107293, 463984]

list_x = [25, 48, 23, 13, -18, -10, -3, 16, 2, -12, 20, -14, 14, 45, 41, 6, 11, 15, 22,
          -14, -11, 41, 15, 48, 47, 41, -8, 1, 4, 1, 40, 27, -11, -2, -14, -15, 35, 4,
          49, 4, 5, 13, 50, 35, -3, 3, 30, -11, 7, 12]

list_y = [-9, 17, 41, 47, -5, -10, -5, 13, 31, -11, 37, 9, 46, 27, -1, 36, 32, 23, -12,
          38, 8, 9, 17, 16, 29, -4, 4, 2, 1, 46, 6, 49, -16, 21, -19, -10, 15, -13, 20,
          13, -18, 21, -17, 21, 10, 5, 38, -1, 18, 22]

list_w = [9, -26, 3, 21, 48, -14, 43, -4, -16, 16, 41, 43, -27, -9, 10, -10, 4, -2, 1,
          7, 30, -29, 11, 17, 31, 31, -26, 38, 38, -17, 35, 17, 35, 10, -25, 42, -30,
          -10, -20, 20, 15, 0, 29, -30, -21, -13, -27, -21, -18, -26]

print(list(map(lambda x, y, w: x ** 2 - x*y*w + w ** 4, list_x, list_y, list_w)))
print([x ** 2 - x*y*w + w ** 4 for x, y, w in zip(list_x, list_y, list_w)])
