# Программа получает на вход строку и ваша задача вывести первый элемент данной строки

# Sample Input 1:

# Zemfira
# Sample Output 1:

# Z
# Sample Input 2:

# It
# Sample Output 2:

# I

print(a[0] if len(a := input()) >= 1 else "string index out of range")
