# Программа получает на вход строку и ваша задача вывести последний символ этой строки

# Sample Input 1:

# Сплин
# Sample Output 1:

# н
# Sample Input 2:

# Billie Eilish
# Sample Output 2:

# h

print(a[-1] if len(a := input()) >= 1 else "string index out of range")
