# Программа получает на вход строку и ваша задача вывести последние 4 символа этой строки

# Гарантируется, что будет вводиться строка длиной не менее 4 символов

# Sample Input:

# Манчестер сити
# Sample Output:

# сити

print(input()[-4:])
