# Программа получает на вход строку.
# Ваша задача вывести все символы этой строки, которые имеют четные индексы

# Sample Input:

# Монти Пайтон
# Sample Output:

# МниПйо

print(input()[::2])
