# Программа получает на вход строку.
# Ваша задача вывести все символы этой строки, которые имеют нечетные индексы

# Sample Input:

# Donald Trump
# Sample Output:

# oadTup

print(input()[1::2])
