# Программа получает на вход строку. Ваша задача развернуть строку и вывести ее на экран.

# Sample Input:

# leetcode.com
# Sample Output:

# moc.edocteel

print(input()[::-1])
