# Программа получает на вход строку.

# Выведите каждый третий символ строки в обратном порядке, начиная с последнего.

# Sample Input:

# The Big Bang Theory
# Sample Output:

# ye ag T

print(input()[::-3])
