# Начальник дал Ване задачу возвести в квадрат два числа и сложить полученные результаты.
# Но Ваня очень разволновался и допустил несколько ошибок.
#
# Вам, как опытному коллеге, необходимо исправить ошибки Вани,
# чтобы начальник не лишил его зарплаты.  Исправления нужно сделать только в пределах одной строки.
#
# Вводить и выводить ничего не нужно
#
# Sample Input 1:
#
# 8
# 11
# Sample Output 1:
#
# 185.0
# Sample Input 2:
#
# 1
# 2
# Sample Output 2:
#
# 5.0
# Sample Input 3:
#
# 3
# 0.9
# Sample Output 3:
#
# 9.81
# Sample Input 4:
#
# 10.0
# 1.5
# Sample Output 4:
#
# 102.25

sq = lambda x, y: x ** 2 + y ** 2
