# Найдите результат выражения |a| + |b|

# Значения переменных а и b поступают на вход в отдельных строках и могут быть только целого типа.

print(abs(int(input())) + abs(int(input())))
