# Напишите программу, которая вычисляет длину отрезка (т.е. расстояние между двумя точками),
# заданного двумя значениями x1 и x2 (вещественные числа).

a, b = float(input()), float(input())
print(((a - b) ** 2) ** 0.5)
