# Напишите программу, которая принимает на вход возраст человека
# (количество полных лет) и выводит сколько лет ему исполнится в следующем году.

years = int(input())
print(years + 1)
# print(int(input())+1)
