# Площадь квадрата

# Давайте напишем программу, которая вычисляет площадь квадрата по введенной длине.

# Входные данные
# На вход программе поступает вещественное число a

# Выходные данные
# Программа выводит площадь квадрата

print(square := float(input()) ** 2)
