# Сумма двух чисел

# Напишите программу, которая принимает на вход два целых числа в отдельных строках
# и выводит на экран их сумму.

# Sample Input 1:

# 7
# 5
# Sample Output 1:

# 12

num1, num2 = int(input()), int(input())
print(num1+num2)
