# Откуда взялись эти правила?

# Все эти правила пришли из стандарта PEP8.
# Это объемный документ, описывающий свод правил оформления кода на языке Python.
# Он, к примеру, описывает как нужно называть переменные,
# сколько отступов и пробелов ставить в разных конструкциях языка и т.д.

# Перечислять все правила не имеет смысла, просто обращайте внимание на эти лампочки,
# они вам подскажут, что нужно исправить в коде, чтобы он соответствовал стандарту PEP8

# Когда мы с вами перейдем с IDLE на pyCharm,
# я покажу как нажатием пары клавиш можно отформатировать свой код,
# чтобы он стал соответствовать стандарту PEP8.
